# ValidateRiseDropSymbolType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MechanicalSystemType..::..ValidateRiseDropSymbolType Method
MechanicalSystemType Class See Also
---
Confirms if the parameter is a valid HVAC rise/drop symbol type.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool ValidateRiseDropSymbolType(
	RiseDropSymbol risedropType
)
```

Visual Basic
---
```text
Public Function ValidateRiseDropSymbolType ( _
	risedropType As RiseDropSymbol _
) As Boolean
```

Visual C++
---
```text
public:
bool ValidateRiseDropSymbolType(
	RiseDropSymbol risedropType
)
```

# ### Parameters
risedropType
    Type: Autodesk.Revit.DB.Mechanical..::..RiseDropSymbol The type.
# ### Return Value
True if the input is a valid HVAC rise/drop symbol type, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
MechanicalSystemType Class
Autodesk.Revit.DB.Mechanical Namespace